apache/nuttx/arch/arm/src/imxrt/hardware/rt102x/imxrt102x_xbar.h
/* XBAR Defines for IMXRT102x */

/* XBARA1 Mux inputs (I values) *********************************************/

#define IMXRT_XBARA1_IN_LOGIC_LOW             IMXRT_XBARA1(XBAR_INPUT, 0)    /* LOGIC_LOW output assigned to XBARA1_IN0 input. */
#define IMXRT_XBARA1_IN_LOGIC_HIGH            IMXRT_XBARA1(XBAR_INPUT, 1)    /* LOGIC_HIGH output assigned to XBARA1_IN1 input. */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 2) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 3) */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO04       IMXRT_XBARA1(XBAR_INPUT, 4)    /* IOMUX_XBAR_INOUT04 output assigned to XBARA1_IN4 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO05       IMXRT_XBARA1(XBAR_INPUT, 5)    /* IOMUX_XBAR_INOUT05 output assigned to XBARA1_IN5 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO06       IMXRT_XBARA1(XBAR_INPUT, 6)    /* IOMUX_XBAR_INOUT06 output assigned to XBARA1_IN6 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO07       IMXRT_XBARA1(XBAR_INPUT, 7)    /* IOMUX_XBAR_INOUT07 output assigned to XBARA1_IN7 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO08       IMXRT_XBARA1(XBAR_INPUT, 8)    /* IOMUX_XBAR_INOUT08 output assigned to XBARA1_IN8 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO09       IMXRT_XBARA1(XBAR_INPUT, 9)    /* IOMUX_XBAR_INOUT09 output assigned to XBARA1_IN9 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO10       IMXRT_XBARA1(XBAR_INPUT, 10)   /* IOMUX_XBAR_INOUT10 output assigned to XBARA1_IN10 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO11       IMXRT_XBARA1(XBAR_INPUT, 11)   /* IOMUX_XBAR_INOUT11 output assigned to XBARA1_IN11 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO12       IMXRT_XBARA1(XBAR_INPUT, 12)   /* IOMUX_XBAR_INOUT12 output assigned to XBARA1_IN12 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO13       IMXRT_XBARA1(XBAR_INPUT, 13)   /* IOMUX_XBAR_INOUT13 output assigned to XBARA1_IN13 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO14       IMXRT_XBARA1(XBAR_INPUT, 14)   /* IOMUX_XBAR_INOUT14 output assigned to XBARA1_IN14 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO15       IMXRT_XBARA1(XBAR_INPUT, 15)   /* IOMUX_XBAR_INOUT15 output assigned to XBARA1_IN15 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO16       IMXRT_XBARA1(XBAR_INPUT, 16)   /* IOMUX_XBAR_INOUT16 output assigned to XBARA1_IN16 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO17       IMXRT_XBARA1(XBAR_INPUT, 17)   /* IOMUX_XBAR_INOUT17 output assigned to XBARA1_IN17 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO18       IMXRT_XBARA1(XBAR_INPUT, 18)   /* IOMUX_XBAR_INOUT18 output assigned to XBARA1_IN18 input. */
#define IMXRT_XBARA1_IN_IOMUX_XBAR_IO19       IMXRT_XBARA1(XBAR_INPUT, 19)   /* IOMUX_XBAR_INOUT19 output assigned to XBARA1_IN19 input. */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 20) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 21) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 22) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 23) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 24) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 25) */
#define IMXRT_XBARA1_IN_ACMP1_OUT             IMXRT_XBARA1(XBAR_INPUT, 26)   /* ACMP1_OUT output assigned to XBARA1_IN26 input. */
#define IMXRT_XBARA1_IN_ACMP2_OUT             IMXRT_XBARA1(XBAR_INPUT, 27)   /* ACMP2_OUT output assigned to XBARA1_IN27 input. */
#define IMXRT_XBARA1_IN_ACMP3_OUT             IMXRT_XBARA1(XBAR_INPUT, 28)   /* ACMP3_OUT output assigned to XBARA1_IN28 input. */
#define IMXRT_XBARA1_IN_ACMP4_OUT             IMXRT_XBARA1(XBAR_INPUT, 29)   /* ACMP4_OUT output assigned to XBARA1_IN29 input. */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 30) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 31) */
#define IMXRT_XBARA1_IN_QTIMER1_TMR0_OUT                 IMXRT_XBARA1(XBAR_INPUT, 32)   /* QTIMER3_TMR0_OUTPUT output assigned to XBARA1_IN32 input. */
#define IMXRT_XBARA1_IN_QTIMER1_TMR1_OUT                 IMXRT_XBARA1(XBAR_INPUT, 33)   /* QTIMER3_TMR1_OUTPUT output assigned to XBARA1_IN33 input. */
#define IMXRT_XBARA1_IN_QTIMER1_TMR2_OUT                 IMXRT_XBARA1(XBAR_INPUT, 34)   /* QTIMER3_TMR2_OUTPUT output assigned to XBARA1_IN34 input. */
#define IMXRT_XBARA1_IN_QTIMER1_TMR3_OUT                 IMXRT_XBARA1(XBAR_INPUT, 35)   /* QTIMER3_TMR3_OUTPUT output assigned to XBARA1_IN35 input. */
#define IMXRT_XBARA1_IN_QTIMER2_TMR0_OUT                 IMXRT_XBARA1(XBAR_INPUT, 36)   /* QTIMER4_TMR0_OUTPUT output assigned to XBARA1_IN36 input. */
#define IMXRT_XBARA1_IN_QTIMER2_TMR1_OUT                 IMXRT_XBARA1(XBAR_INPUT, 37)   /* QTIMER4_TMR1_OUTPUT output assigned to XBARA1_IN37 input. */
#define IMXRT_XBARA1_IN_QTIMER2_TMR2_OUT                 IMXRT_XBARA1(XBAR_INPUT, 38)   /* QTIMER4_TMR2_OUTPUT output assigned to XBARA1_IN38 input. */
#define IMXRT_XBARA1_IN_QTIMER2_TMR3_OUT                 IMXRT_XBARA1(XBAR_INPUT, 39)   /* QTIMER4_TMR3_OUTPUT output assigned to XBARA1_IN39 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM1_OUT_TRIG0          IMXRT_XBARA1(XBAR_INPUT, 40)   /* FLEXPWM1_PWM1_OUT_TRIG0 output OR assigned to XBARA1_IN40 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM1_OUT_TRIG1          IMXRT_XBARA1(XBAR_INPUT, 40)   /* FLEXPWM1_PWM1_OUT_TRIG1 output OR assigned to XBARA1_IN40 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM2_OUT_TRIG0          IMXRT_XBARA1(XBAR_INPUT, 41)   /* FLEXPWM1_PWM2_OUT_TRIG0 output OR assigned to XBARA1_IN41 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM2_OUT_TRIG1          IMXRT_XBARA1(XBAR_INPUT, 41)   /* FLEXPWM1_PWM2_OUT_TRIG1 output OR assigned to XBARA1_IN41 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM3_OUT_TRIG0          IMXRT_XBARA1(XBAR_INPUT, 42)   /* FLEXPWM1_PWM3_OUT_TRIG0 output OR assigned to XBARA1_IN42 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM3_OUT_TRIG1          IMXRT_XBARA1(XBAR_INPUT, 42)   /* FLEXPWM1_PWM3_OUT_TRIG1 output OR assigned to XBARA1_IN42 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM4_OUT_TRIG0          IMXRT_XBARA1(XBAR_INPUT, 43)   /* FLEXPWM1_PWM4_OUT_TRIG0 output OR assigned to XBARA1_IN43 input. */
#define IMXRT_XBARA1_IN_FLEXPWM1_PWM4_OUT_TRIG1          IMXRT_XBARA1(XBAR_INPUT, 43)   /* FLEXPWM1_PWM4_OUT_TRIG1 output OR assigned to XBARA1_IN43 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM1_OUT_TRIG0          IMXRT_XBARA1(XBAR_INPUT, 44)   /* FLEXPWM2_PWM1_OUT_TRIG0 output OR assigned to XBARA1_IN44 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM1_OUT_TRIG1          IMXRT_XBARA1(XBAR_INPUT, 44)   /* FLEXPWM2_PWM1_OUT_TRIG1 output OR assigned to XBARA1_IN44 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM2_OUT_TRIG0          IMXRT_XBARA1(XBAR_INPUT, 45)   /* FLEXPWM2_PWM2_OUT_TRIG0 output OR assigned to XBARA1_IN45 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM2_OUT_TRIG1          IMXRT_XBARA1(XBAR_INPUT, 45)   /* FLEXPWM2_PWM2_OUT_TRIG1 output OR assigned to XBARA1_IN45 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM3_OUT_TRIG0          IMXRT_XBARA1(XBAR_INPUT, 46)   /* FLEXPWM2_PWM3_OUT_TRIG0 output OR assigned to XBARA1_IN46 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM3_OUT_TRIG1          IMXRT_XBARA1(XBAR_INPUT, 46)   /* FLEXPWM2_PWM3_OUT_TRIG1 output OR assigned to XBARA1_IN46 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM4_OUT_TRIG0          IMXRT_XBARA1(XBAR_INPUT, 47)   /* FLEXPWM2_PWM4_OUT_TRIG0 output OR assigned to XBARA1_IN47 input. */
#define IMXRT_XBARA1_IN_FLEXPWM2_PWM4_OUT_TRIG1          IMXRT_XBARA1(XBAR_INPUT, 47)   /* FLEXPWM2_PWM4_OUT_TRIG1 output OR assigned to XBARA1_IN47 input. */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 48) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 49) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 50) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 51) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 52) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 53) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 54) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 55) */
#define IMXRT_XBARA1_IN_PIT_TRIGGER0          IMXRT_XBARA1(XBAR_INPUT, 56)   /* PIT_TRIGGER0 output assigned to XBARA1_IN56 input. */
#define IMXRT_XBARA1_IN_PIT_TRIGGER1          IMXRT_XBARA1(XBAR_INPUT, 57)   /* PIT_TRIGGER1 output assigned to XBARA1_IN57 input. */
#define IMXRT_XBARA1_IN_PIT_TRIGGER2          IMXRT_XBARA1(XBAR_INPUT, 58)   /* PIT_TRIGGER2 output assigned to XBARA1_IN58 input. */
#define IMXRT_XBARA1_IN_PIT_TRIGGER3          IMXRT_XBARA1(XBAR_INPUT, 59)   /* PIT_TRIGGER3 output assigned to XBARA1_IN59 input. */
#define IMXRT_XBARA1_IN_ENC1_POS_MATCH        IMXRT_XBARA1(XBAR_INPUT, 60)   /* ENC1_POS_MATCH output assigned to XBARA1_IN60 input. */
#define IMXRT_XBARA1_IN_ENC2_POS_MATCH        IMXRT_XBARA1(XBAR_INPUT, 61)   /* ENC2_POS_MATCH output assigned to XBARA1_IN61 input. */

