apache/nuttx/arch/arm/src/imxrt/hardware/rt102x/imxrt102x_xbar.h
/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 62) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 63) */
#define IMXRT_XBARA1_IN_DMA_DONE0             IMXRT_XBARA1(XBAR_INPUT, 64)   /* DMA_DONE0 output assigned to XBARA1_IN64 input. */
#define IMXRT_XBARA1_IN_DMA_DONE1             IMXRT_XBARA1(XBAR_INPUT, 65)   /* DMA_DONE1 output assigned to XBARA1_IN65 input. */
#define IMXRT_XBARA1_IN_DMA_DONE2             IMXRT_XBARA1(XBAR_INPUT, 66)   /* DMA_DONE2 output assigned to XBARA1_IN66 input. */
#define IMXRT_XBARA1_IN_DMA_DONE3             IMXRT_XBARA1(XBAR_INPUT, 67)   /* DMA_DONE3 output assigned to XBARA1_IN67 input. */
#define IMXRT_XBARA1_IN_DMA_DONE4             IMXRT_XBARA1(XBAR_INPUT, 68)   /* DMA_DONE4 output assigned to XBARA1_IN68 input. */
#define IMXRT_XBARA1_IN_DMA_DONE5             IMXRT_XBARA1(XBAR_INPUT, 69)   /* DMA_DONE5 output assigned to XBARA1_IN69 input. */
#define IMXRT_XBARA1_IN_DMA_DONE6             IMXRT_XBARA1(XBAR_INPUT, 70)   /* DMA_DONE6 output assigned to XBARA1_IN70 input. */
#define IMXRT_XBARA1_IN_DMA_DONE7             IMXRT_XBARA1(XBAR_INPUT, 71)   /* DMA_DONE7 output assigned to XBARA1_IN71 input. */
#define IMXRT_XBARA1_IN_AOI1_OUT0             IMXRT_XBARA1(XBAR_INPUT, 72)   /* AOI1_OUT0 output assigned to XBARA1_IN72 input. */
#define IMXRT_XBARA1_IN_AOI1_OUT1             IMXRT_XBARA1(XBAR_INPUT, 73)   /* AOI1_OUT1 output assigned to XBARA1_IN73 input. */
#define IMXRT_XBARA1_IN_AOI1_OUT2             IMXRT_XBARA1(XBAR_INPUT, 74)   /* AOI1_OUT2 output assigned to XBARA1_IN74 input. */
#define IMXRT_XBARA1_IN_AOI1_OUT3             IMXRT_XBARA1(XBAR_INPUT, 75)   /* AOI1_OUT3 output assigned to XBARA1_IN75 input. */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 76) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 77) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 78) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_INPUT, 79) */
#define IMXRT_XBARA1_IN_ADC_ETC_XBAR0_COCO0   IMXRT_XBARA1(XBAR_INPUT, 80)   /* ADC_ETC_XBAR0_COCO0 output assigned to XBARA1_IN80 input. */
#define IMXRT_XBARA1_IN_ADC_ETC_XBAR0_COCO1   IMXRT_XBARA1(XBAR_INPUT, 81)   /* ADC_ETC_XBAR0_COCO1 output assigned to XBARA1_IN81 input. */
#define IMXRT_XBARA1_IN_ADC_ETC_XBAR0_COCO2   IMXRT_XBARA1(XBAR_INPUT, 82)   /* ADC_ETC_XBAR0_COCO2 output assigned to XBARA1_IN82 input. */
#define IMXRT_XBARA1_IN_ADC_ETC_XBAR0_COCO3   IMXRT_XBARA1(XBAR_INPUT, 83)   /* ADC_ETC_XBAR0_COCO3 output assigned to XBARA1_IN83 input. */
#define IMXRT_XBARA1_IN_ADC_ETC_XBAR1_COCO0   IMXRT_XBARA1(XBAR_INPUT, 84)   /* ADC_ETC_XBAR1_COCO0 output assigned to XBARA1_IN84 input. */
#define IMXRT_XBARA1_IN_ADC_ETC_XBAR1_COCO1   IMXRT_XBARA1(XBAR_INPUT, 85)   /* ADC_ETC_XBAR1_COCO1 output assigned to XBARA1_IN85 input. */
#define IMXRT_XBARA1_IN_ADC_ETC_XBAR1_COCO2   IMXRT_XBARA1(XBAR_INPUT, 86)   /* ADC_ETC_XBAR1_COCO2 output assigned to XBARA1_IN86 input. */
#define IMXRT_XBARA1_IN_ADC_ETC_XBAR1_COCO3   IMXRT_XBARA1(XBAR_INPUT, 87)   /* ADC_ETC_XBAR1_COCO3 output assigned to XBARA1_IN87 input. */

/* XBARA1 Mux Output  (M Muxes) *********************************************/

#define IMXRT_XBARA1_OUT_DMA_CH_MUX_REQ30_SEL_OFFSET     IMXRT_XBARA1(XBAR_OUTPUT, 0)    /* XBARA1_OUT0 output assigned to DMA_CH_MUX_REQ30 */
#define IMXRT_XBARA1_OUT_DMA_CH_MUX_REQ31_SEL_OFFSET     IMXRT_XBARA1(XBAR_OUTPUT, 1)    /* XBARA1_OUT1 output assigned to DMA_CH_MUX_REQ31 */
#define IMXRT_XBARA1_OUT_DMA_CH_MUX_REQ94_SEL_OFFSET     IMXRT_XBARA1(XBAR_OUTPUT, 2)    /* XBARA1_OUT2 output assigned to DMA_CH_MUX_REQ94 */
#define IMXRT_XBARA1_OUT_DMA_CH_MUX_REQ95_SEL_OFFSET     IMXRT_XBARA1(XBAR_OUTPUT, 3)    /* XBARA1_OUT3 output assigned to DMA_CH_MUX_REQ95 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO04_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 4)    /* XBARA1_OUT4 output assigned to IOMUX_XBAR_INOUT04 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO05_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 5)    /* XBARA1_OUT5 output assigned to IOMUX_XBAR_INOUT05 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO06_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 6)    /* XBARA1_OUT6 output assigned to IOMUX_XBAR_INOUT06 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO07_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 7)    /* XBARA1_OUT7 output assigned to IOMUX_XBAR_INOUT07 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO08_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 8)    /* XBARA1_OUT8 output assigned to IOMUX_XBAR_INOUT08 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO09_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 9)    /* XBARA1_OUT9 output assigned to IOMUX_XBAR_INOUT09 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO10_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 10)   /* XBARA1_OUT10 output assigned to IOMUX_XBAR_INOUT10 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO11_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 11)   /* XBARA1_OUT11 output assigned to IOMUX_XBAR_INOUT11 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO12_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 12)   /* XBARA1_OUT12 output assigned to IOMUX_XBAR_INOUT12 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO13_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 13)   /* XBARA1_OUT13 output assigned to IOMUX_XBAR_INOUT13 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO14_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 14)   /* XBARA1_OUT14 output assigned to IOMUX_XBAR_INOUT14 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO15_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 15)   /* XBARA1_OUT15 output assigned to IOMUX_XBAR_INOUT15 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO16_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 16)   /* XBARA1_OUT16 output assigned to IOMUX_XBAR_INOUT16 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO17_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 17)   /* XBARA1_OUT17 output assigned to IOMUX_XBAR_INOUT17 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO18_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 18)   /* XBARA1_OUT18 output assigned to IOMUX_XBAR_INOUT18 */
#define IMXRT_XBARA1_OUT_IOMUX_XBAR_IO19_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 19)   /* XBARA1_OUT19 output assigned to IOMUX_XBAR_INOUT19 */
#define IMXRT_XBARA1_OUT_ACMP1_SAMPLE_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 20)   /* XBARA1_OUT20 output assigned to ACMP1_SAMPLE */
#define IMXRT_XBARA1_OUT_ACMP2_SAMPLE_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 21)   /* XBARA1_OUT21 output assigned to ACMP2_SAMPLE */
#define IMXRT_XBARA1_OUT_ACMP3_SAMPLE_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 22)   /* XBARA1_OUT22 output assigned to ACMP3_SAMPLE */
#define IMXRT_XBARA1_OUT_ACMP4_SAMPLE_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 23)   /* XBARA1_OUT23 output assigned to ACMP4_SAMPLE */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 24) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 25) */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXTA0_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 26)   /* XBARA1_OUT26 output assigned to FLEXPWM1_EXTA0 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXTA1_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 27)   /* XBARA1_OUT27 output assigned to FLEXPWM1_EXTA1 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXTA2_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 28)   /* XBARA1_OUT28 output assigned to FLEXPWM1_EXTA2 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXTA3_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 29)   /* XBARA1_OUT29 output assigned to FLEXPWM1_EXTA3 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXT_SYNC0_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 30)   /* XBARA1_OUT30 output assigned to FLEXPWM1_EXT_SYNC0 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXT_SYNC1_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 31)   /* XBARA1_OUT31 output assigned to FLEXPWM1_EXT_SYNC1 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXT_SYNC2_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 32)   /* XBARA1_OUT32 output assigned to FLEXPWM1_EXT_SYNC2 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXT_SYNC3_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 33)   /* XBARA1_OUT33 output assigned to FLEXPWM1_EXT_SYNC3 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXT_CLK_SEL_OFFSET     IMXRT_XBARA1(XBAR_OUTPUT, 34)   /* XBARA1_OUT34 output assigned to FLEXPWM1_EXT_CLK */
#define IMXRT_XBARA1_OUT_FLEXPWM1_FAULT0_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 35)   /* XBARA1_OUT35 output assigned to FLEXPWM1_FAULT0 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_FAULT1_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 36)   /* XBARA1_OUT36 output assigned to FLEXPWM1_FAULT1 */
#define IMXRT_XBARA1_OUT_FLEXPWM12_FAULT2_SEL_OFFSET     IMXXRT_XBARA1(XBAR_OUTPUT,37)   /* XBARA1_OUT37 output assigned to FLEXPWM1_2_FAULT2 */
#define IMXRT_XBARA1_OUT_FLEXPWM12_FAULT3_SEL_OFFSET     IMXRT_XBARA1(XBAR_OUTPUT, 38)   /* XBARA1_OUT38 output assigned to FLEXPWM1_2_FAULT3 */
#define IMXRT_XBARA1_OUT_FLEXPWM1_EXT_FORCE_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 39)   /* XBARA1_OUT39 output assigned to FLEXPWM1_EXT_FORCE */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXTA0_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 40)   /* XBARA1_OUT40 output assigned to FLEXPWM2_EXTA0 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXTA1_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 41)   /* XBARA1_OUT41 output assigned to FLEXPWM2_EXTA1 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXTA2_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 42)   /* XBARA1_OUT42 output assigned to FLEXPWM2_EXTA2 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXTA3_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 43)   /* XBARA1_OUT43 output assigned to FLEXPWM2_EXTA3 */

#define IMXRT_XBARA1_OUT_FLEXPWM2_EXT_SYNC0_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 44)   /* XBARA1_OUT44 output assigned to FLEXPWM2_EXT_SYNC0 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXT_SYNC1_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 45)   /* XBARA1_OUT45 output assigned to FLEXPWM2_EXT_SYNC1 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXT_SYNC2_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 46)   /* XBARA1_OUT46 output assigned to FLEXPWM2_EXT_SYNC2 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXT_SYNC3_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 47)   /* XBARA1_OUT47 output assigned to FLEXPWM2_EXT_SYNC3 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXT_CLK_SEL_OFFSET     IMXRT_XBARA1(XBAR_OUTPUT, 48)   /* XBARA1_OUT48 output assigned to FLEXPWM2_EXT_CLK */
#define IMXRT_XBARA1_OUT_FLEXPWM2_FAULT0_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 49)   /* XBARA1_OUT49 output assigned to FLEXPWM2_FAULT0 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_FAULT1_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 50)   /* XBARA1_OUT50 output assigned to FLEXPWM2_FAULT1 */
#define IMXRT_XBARA1_OUT_FLEXPWM2_EXT_FORCE_SEL_OFFSET   IMXRT_XBARA1(XBAR_OUTPUT, 51)   /* XBARA1_OUT51 output assigned to FLEXPWM2_EXT_FORCE */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 52) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 53) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 54) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 55) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 56) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 57) */

