apache/nuttx/arch/arm/src/imxrt/hardware/rt102x/imxrt102x_xbar.h
/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 58) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 59) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 60) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 61) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 62) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 63) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 64) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 65) */
#define IMXRT_XBARA1_OUT_ENC1_PHASE_AIN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 66)   /* XBARA1_OUT66 output assigned to ENC1_PHASE_A_IN */
#define IMXRT_XBARA1_OUT_ENC1_PHASE_BIN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 67)   /* XBARA1_OUT67 output assigned to ENC1_PHASE_B_IN */
#define IMXRT_XBARA1_OUT_ENC1_INDEX_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 68)   /* XBARA1_OUT68 output assigned to ENC1_INDEX */
#define IMXRT_XBARA1_OUT_ENC1_HOME_SEL_OFFSET            IMXRT_XBARA1(XBAR_OUTPUT, 69)   /* XBARA1_OUT69 output assigned to ENC1_HOME */
#define IMXRT_XBARA1_OUT_ENC1_TRIGGER_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 70)   /* XBARA1_OUT70 output assigned to ENC1_TRIGGER */
#define IMXRT_XBARA1_OUT_ENC2_PHASE_AIN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 71)   /* XBARA1_OUT71 output assigned to ENC2_PHASE_A_IN */
#define IMXRT_XBARA1_OUT_ENC2_PHASE_BIN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 72)   /* XBARA1_OUT72 output assigned to ENC2_PHASE_B_IN */
#define IMXRT_XBARA1_OUT_ENC2_INDEX_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 73)   /* XBARA1_OUT73 output assigned to ENC2_INDEX */
#define IMXRT_XBARA1_OUT_ENC2_HOME_SEL_OFFSET            IMXRT_XBARA1(XBAR_OUTPUT, 74)   /* XBARA1_OUT74 output assigned to ENC2_HOME */
#define IMXRT_XBARA1_OUT_ENC2_TRIGGER_SEL_OFFSET         IMXRT_XBARA1(XBAR_OUTPUT, 75)   /* XBARA1_OUT75 output assigned to ENC2_TRIGGER */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 76) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 77) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 78) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 79) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 80) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 81) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 82) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 83) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 84) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 85) */
#define IMXRT_XBARA1_OUT_QTIMER1_TMR0_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 86)   /* XBARA1_OUT86 output assigned to QTIMER1_TMR0_IN_ */
#define IMXRT_XBARA1_OUT_QTIMER1_TMR1_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 87)   /* XBARA1_OUT87 output assigned to QTIMER1_TMR1_IN_ */
#define IMXRT_XBARA1_OUT_QTIMER1_TMR2_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 88)   /* XBARA1_OUT88 output assigned to QTIMER1_TMR2_IN_ */
#define IMXRT_XBARA1_OUT_QTIMER1_TMR3_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 89)   /* XBARA1_OUT89 output assigned to QTIMER1_TMR3_IN_ */
#define IMXRT_XBARA1_OUT_QTIMER2_TMR0_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 90)   /* XBARA1_OUT90 output assigned to QTIMER2_TMR0_IN_ */
#define IMXRT_XBARA1_OUT_QTIMER2_TMR1_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 91)   /* XBARA1_OUT91 output assigned to QTIMER2_TMR1_IN_ */
#define IMXRT_XBARA1_OUT_QTIMER2_TMR2_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 92)   /* XBARA1_OUT92 output assigned to QTIMER2_TMR2_IN_ */
#define IMXRT_XBARA1_OUT_QTIMER2_TMR3_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 93)   /* XBARA1_OUT93 output assigned to QTIMER2_TMR3_IN_ */
#define IMXRT_XBARA1_OUT_QTIMER3_TMR0_IN_SEL_OFFSET      IMXRT_XBARA1(XBAR_OUTPUT, 94)   /* XBARA1_OUT94 output assigned to QTIMER3_TMR0_IN_ */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 95) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 96) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 97) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 98) */

/* RESERVED                                   IMXRT_XBARA1(XBAR_OUTPUT, 99) */

/* RESERVED                                  IMXRT_XBARA1(XBAR_OUTPUT, 100) */

/* RESERVED                                  IMXRT_XBARA1(XBAR_OUTPUT, 101) */
#define IMXRT_XBARA1_OUT_EWM_EWM_IN_SEL_OFFSET           IMXRT_XBARA1(XBAR_OUTPUT, 102)  /* XBARA1_OUT102 output assigned to EWM_EWM_IN */
#define IMXRT_XBARA1_OUT_ADC_ETC_XBAR0_TRIG0_SEL_OFFSET  IMXRT_XBARA1(XBAR_OUTPUT, 103)  /* XBARA1_OUT103 output assigned to ADC_ETC_XBAR0_TRIG0 */
#define IMXRT_XBARA1_OUT_ADC_ETC_XBAR0_TRIG1_SEL_OFFSET  IMXRT_XBARA1(XBAR_OUTPUT, 104)  /* XBARA1_OUT104 output assigned to ADC_ETC_XBAR0_TRIG1 */
#define IMXRT_XBARA1_OUT_ADC_ETC_XBAR0_TRIG2_SEL_OFFSET  IMXRT_XBARA1(XBAR_OUTPUT, 105)  /* XBARA1_OUT105 output assigned to ADC_ETC_XBAR0_TRIG2 */
#define IMXRT_XBARA1_OUT_ADC_ETC_XBAR0_TRIG3_SEL_OFFSET  IMXRT_XBARA1(XBAR_OUTPUT, 106)  /* XBARA1_OUT106 output assigned to ADC_ETC_XBAR0_TRIG3 */
#define IMXRT_XBARA1_OUT_ADC_ETC_XBAR1_TRIG10_SEL_OFFSET IMXRT_XBARA1(XBAR_OUTPUT, 107)  /* XBARA1_OUT107 output assigned to ADC_ETC_XBAR1_TRIG10 */
#define IMXRT_XBARA1_OUT_ADC_ETC_XBAR1_TRIG11_SEL_OFFSET IMXRT_XBARA1(XBAR_OUTPUT, 108)  /* XBARA1_OUT108 output assigned to ADC_ETC_XBAR1_TRIG11 */
#define IMXRT_XBARA1_OUT_ADC_ETC_XBAR1_TRIG12_SEL_OFFSET IMXRT_XBARA1(XBAR_OUTPUT, 109)  /* XBARA1_OUT109 output assigned to ADC_ETC_XBAR1_TRIG12 */
#define IMXRT_XBARA1_OUT_ADC_ETC_XBAR1_TRIG13_SEL_OFFSET IMXRT_XBARA1(XBAR_OUTPUT, 110)  /* XBARA1_OUT110 output assigned to ADC_ETC_XBAR1_TRIG13 */
#define IMXRT_XBARA1_OUT_LPI2C1_TRG_IN_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 111)  /* XBARA1_OUT111 output assigned to LPI2C1_TRG_IN */
#define IMXRT_XBARA1_OUT_LPI2C2_TRG_IN_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 112)  /* XBARA1_OUT112 output assigned to LPI2C2_TRG_IN */
#define IMXRT_XBARA1_OUT_LPI2C3_TRG_IN_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 113)  /* XBARA1_OUT113 output assigned to LPI2C3_TRG_IN */
#define IMXRT_XBARA1_OUT_LPI2C4_TRG_IN_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 114)  /* XBARA1_OUT114 output assigned to LPI2C4_TRG_IN */
#define IMXRT_XBARA1_OUT_LPSPI1_TRG_IN_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 115)  /* XBARA1_OUT115 output assigned to LPSPI1_TRG_IN */
#define IMXRT_XBARA1_OUT_LPSPI2_TRG_IN_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 116)  /* XBARA1_OUT116 output assigned to LPSPI2_TRG_IN */
#define IMXRT_XBARA1_OUT_LPSPI3_TRG_IN_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 117)  /* XBARA1_OUT117 output assigned to LPSPI3_TRG_IN */
#define IMXRT_XBARA1_OUT_LPSPI4_TRG_IN_SEL_OFFSET        IMXRT_XBARA1(XBAR_OUTPUT, 118)  /* XBARA1_OUT118 output assigned to LPSPI4_TRG_IN */
#define IMXRT_XBARA1_OUT_LPUART1_TRG_IN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 119)  /* XBARA1_OUT119 output assigned to LPUART1_TRG_IN */
#define IMXRT_XBARA1_OUT_LPUART2_TRG_IN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 120)  /* XBARA1_OUT120 output assigned to LPUART2_TRG_IN */
#define IMXRT_XBARA1_OUT_LPUART3_TRG_IN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 121)  /* XBARA1_OUT121 output assigned to LPUART3_TRG_IN */
#define IMXRT_XBARA1_OUT_LPUART4_TRG_IN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 122)  /* XBARA1_OUT122 output assigned to LPUART4_TRG_IN */
#define IMXRT_XBARA1_OUT_LPUART5_TRG_IN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 123)  /* XBARA1_OUT123 output assigned to LPUART5_TRG_IN */
#define IMXRT_XBARA1_OUT_LPUART6_TRG_IN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 124)  /* XBARA1_OUT124 output assigned to LPUART6_TRG_IN */
#define IMXRT_XBARA1_OUT_LPUART7_TRG_IN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 125)  /* XBARA1_OUT125 output assigned to LPUART7_TRG_IN */
#define IMXRT_XBARA1_OUT_LPUART8_TRG_IN_SEL_OFFSET       IMXRT_XBARA1(XBAR_OUTPUT, 126)  /* XBARA1_OUT126 output assigned to LPUART8_TRG_IN */
#define IMXRT_XBARA1_OUT_FLEXIO1_TRIGGER_IN0_SEL_OFFSET  IMXRT_XBARA1(XBAR_OUTPUT, 127)  /* XBARA1_OUT127 output assigned to FLEXIO1_TRIGGER_IN0 */
#define IMXRT_XBARA1_OUT_FLEXIO1_TRIGGER_IN1_SEL_OFFSET  IMXRT_XBARA1(XBAR_OUTPUT, 128)  /* XBARA1_OUT128 output assigned to FLEXIO1_TRIGGER_IN1 */

