apache/nuttx/arch/arm/src/imxrt/hardware/rt102x/imxrt102x_xbar.h
/* RESERVED                                  IMXRT_XBARA1(XBAR_OUTPUT, 129) */

/* RESERVED                                  IMXRT_XBARA1(XBAR_OUTPUT, 130) */

/* RESERVED                                  IMXRT_XBARA1(XBAR_OUTPUT, 131) */

/* XBARB2 Mux inputs (I values) *********************************************/

#define IMXRT_XBARB2_IN_LOGIC_LOW             IMXRT_XBARB2(XBAR_INPUT, 0)    /* LOGIC_LOW output assigned to XBARB2_IN0 input. */
#define IMXRT_XBARB2_IN_LOGIC_HIGH            IMXRT_XBARB2(XBAR_INPUT, 1)    /* LOGIC_HIGH output assigned to XBARB2_IN1 input. */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 2) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 3) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 4) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 5) */
#define IMXRT_XBARB2_IN_ACMP1_OUT             IMXRT_XBARB2(XBAR_INPUT, 6)    /* ACMP1_OUT output assigned to XBARB2_IN6 input. */
#define IMXRT_XBARB2_IN_ACMP2_OUT             IMXRT_XBARB2(XBAR_INPUT, 7)    /* ACMP2_OUT output assigned to XBARB2_IN7 input. */
#define IMXRT_XBARB2_IN_ACMP3_OUT             IMXRT_XBARB2(XBAR_INPUT, 8)    /* ACMP3_OUT output assigned to XBARB2_IN8 input. */
#define IMXRT_XBARB2_IN_ACMP4_OUT             IMXRT_XBARB2(XBAR_INPUT, 9)    /* ACMP4_OUT output assigned to XBARB2_IN9 input. */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 10) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 11) */
#define IMXRT_XBARB2_IN_QTIMER1_TMR0_OUT                 IMXRT_XBARB2(XBAR_INPUT, 12)   /* QTIMER3_TMR0_OUTPUT output assigned to XBARB2_IN12 input. */
#define IMXRT_XBARB2_IN_QTIMER1_TMR1_OUT                 IMXRT_XBARB2(XBAR_INPUT, 13)   /* QTIMER3_TMR1_OUTPUT output assigned to XBARB2_IN13 input. */
#define IMXRT_XBARB2_IN_QTIMER1_TMR2_OUT                 IMXRT_XBARB2(XBAR_INPUT, 14)   /* QTIMER3_TMR2_OUTPUT output assigned to XBARB2_IN14 input. */
#define IMXRT_XBARB2_IN_QTIMER1_TMR3_OUT                 IMXRT_XBARB2(XBAR_INPUT, 15)   /* QTIMER3_TMR3_OUTPUT output assigned to XBARB2_IN15 input. */
#define IMXRT_XBARB2_IN_QTIMER2_TMR0_OUT                 IMXRT_XBARB2(XBAR_INPUT, 16)   /* QTIMER4_TMR0_OUTPUT output assigned to XBARB2_IN16 input. */
#define IMXRT_XBARB2_IN_QTIMER2_TMR1_OUT                 IMXRT_XBARB2(XBAR_INPUT, 17)   /* QTIMER4_TMR1_OUTPUT output assigned to XBARB2_IN17 input. */
#define IMXRT_XBARB2_IN_QTIMER2_TMR2_OUT                 IMXRT_XBARB2(XBAR_INPUT, 18)   /* QTIMER4_TMR2_OUTPUT output assigned to XBARB2_IN18 input. */
#define IMXRT_XBARB2_IN_QTIMER2_TMR3_OUT                 IMXRT_XBARB2(XBAR_INPUT, 19)   /* QTIMER4_TMR3_OUTPUT output assigned to XBARB2_IN19 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM1_OUT_TRIG0          IMXRT_XBARB2(XBAR_INPUT, 20)   /* FLEXPWM1_PWM1_OUT_TRIG0 output OR assigned to XBARB2_IN20 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM1_OUT_TRIG1          IMXRT_XBARB2(XBAR_INPUT, 20)   /* FLEXPWM1_PWM1_OUT_TRIG1 output OR assigned to XBARB2_IN20 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM2_OUT_TRIG0          IMXRT_XBARB2(XBAR_INPUT, 21)   /* FLEXPWM1_PWM2_OUT_TRIG0 output OR assigned to XBARB2_IN21 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM2_OUT_TRIG1          IMXRT_XBARB2(XBAR_INPUT, 21)   /* FLEXPWM1_PWM2_OUT_TRIG1 output OR assigned to XBARB2_IN21 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM3_OUT_TRIG0          IMXRT_XBARB2(XBAR_INPUT, 22)   /* FLEXPWM1_PWM3_OUT_TRIG0 output OR assigned to XBARB2_IN22 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM3_OUT_TRIG1          IMXRT_XBARB2(XBAR_INPUT, 22)   /* FLEXPWM1_PWM3_OUT_TRIG1 output OR assigned to XBARB2_IN22 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM4_OUT_TRIG0          IMXRT_XBARB2(XBAR_INPUT, 23)   /* FLEXPWM1_PWM4_OUT_TRIG0 output OR assigned to XBARB2_IN23 input. */
#define IMXRT_XBARB2_IN_FLEXPWM1_PWM4_OUT_TRIG1          IMXRT_XBARB2(XBAR_INPUT, 23)   /* FLEXPWM1_PWM4_OUT_TRIG1 output OR assigned to XBARB2_IN23 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM1_OUT_TRIG0          IMXRT_XBARB2(XBAR_INPUT, 24)   /* FLEXPWM2_PWM1_OUT_TRIG0 output OR assigned to XBARB2_IN24 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM1_OUT_TRIG1          IMXRT_XBARB2(XBAR_INPUT, 24)   /* FLEXPWM2_PWM1_OUT_TRIG1 output OR assigned to XBARB2_IN24 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM2_OUT_TRIG0          IMXRT_XBARB2(XBAR_INPUT, 25)   /* FLEXPWM2_PWM2_OUT_TRIG0 output OR assigned to XBARB2_IN25 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM2_OUT_TRIG1          IMXRT_XBARB2(XBAR_INPUT, 25)   /* FLEXPWM2_PWM2_OUT_TRIG1 output OR assigned to XBARB2_IN25 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM3_OUT_TRIG0          IMXRT_XBARB2(XBAR_INPUT, 26)   /* FLEXPWM2_PWM3_OUT_TRIG0 output OR assigned to XBARB2_IN26 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM3_OUT_TRIG1          IMXRT_XBARB2(XBAR_INPUT, 26)   /* FLEXPWM2_PWM3_OUT_TRIG1 output OR assigned to XBARB2_IN26 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM4_OUT_TRIG0          IMXRT_XBARB2(XBAR_INPUT, 27)   /* FLEXPWM2_PWM4_OUT_TRIG0 output OR assigned to XBARB2_IN27 input. */
#define IMXRT_XBARB2_IN_FLEXPWM2_PWM4_OUT_TRIG1          IMXRT_XBARB2(XBAR_INPUT, 27)   /* FLEXPWM2_PWM4_OUT_TRIG1 output OR assigned to XBARB2_IN27 input. */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 28) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 29) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 30) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 31) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 32) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 33) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 34) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 35) */
#define IMXRT_XBARB2_IN_PIT_TRIGGER0          IMXRT_XBARB2(XBAR_INPUT, 36)   /* PIT_TRIGGER0 output assigned to XBARB2_IN36 input. */
#define IMXRT_XBARB2_IN_PIT_TRIGGER1          IMXRT_XBARB2(XBAR_INPUT, 37)   /* PIT_TRIGGER1 output assigned to XBARB2_IN37 input. */
#define IMXRT_XBARB2_IN_ADC_ETC_XBAR0_COCO0   IMXRT_XBARB2(XBAR_INPUT, 38)   /* ADC_ETC_XBAR0_COCO0 output assigned to XBARB2_IN38 input. */
#define IMXRT_XBARB2_IN_ADC_ETC_XBAR0_COCO1   IMXRT_XBARB2(XBAR_INPUT, 39)   /* ADC_ETC_XBAR0_COCO1 output assigned to XBARB2_IN39 input. */
#define IMXRT_XBARB2_IN_ADC_ETC_XBAR0_COCO2   IMXRT_XBARB2(XBAR_INPUT, 40)   /* ADC_ETC_XBAR0_COCO2 output assigned to XBARB2_IN40 input. */
#define IMXRT_XBARB2_IN_ADC_ETC_XBAR0_COCO3   IMXRT_XBARB2(XBAR_INPUT, 41)   /* ADC_ETC_XBAR0_COCO3 output assigned to XBARB2_IN41 input. */
#define IMXRT_XBARB2_IN_ADC_ETC_XBAR1_COCO0   IMXRT_XBARB2(XBAR_INPUT, 42)   /* ADC_ETC_XBAR1_COCO0 output assigned to XBARB2_IN42 input. */
#define IMXRT_XBARB2_IN_ADC_ETC_XBAR1_COCO1   IMXRT_XBARB2(XBAR_INPUT, 43)   /* ADC_ETC_XBAR1_COCO1 output assigned to XBARB2_IN43 input. */
#define IMXRT_XBARB2_IN_ADC_ETC_XBAR1_COCO2   IMXRT_XBARB2(XBAR_INPUT, 44)   /* ADC_ETC_XBAR1_COCO2 output assigned to XBARB2_IN44 input. */
#define IMXRT_XBARB2_IN_ADC_ETC_XBAR1_COCO3   IMXRT_XBARB2(XBAR_INPUT, 45)   /* ADC_ETC_XBAR1_COCO3 output assigned to XBARB2_IN45 input. */
#define IMXRT_XBARB2_IN_ENC1_POS_MATCH        IMXRT_XBARB2(XBAR_INPUT, 46)   /* ENC1_POS_MATCH output assigned to XBARB2_IN46 input. */
#define IMXRT_XBARB2_IN_ENC2_POS_MATCH        IMXRT_XBARB2(XBAR_INPUT, 47)   /* ENC2_POS_MATCH output assigned to XBARB2_IN47 input. */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 48) */

/* RESERVED                                   IMXRT_XBARB2(XBAR_INPUT, 49) */
#define IMXRT_XBARB2_IN_DMA_DONE0             IMXRT_XBARB2(XBAR_INPUT, 50)   /* DMA_DONE0 output assigned to XBARB2_IN50 input. */
#define IMXRT_XBARB2_IN_DMA_DONE1             IMXRT_XBARB2(XBAR_INPUT, 51)   /* DMA_DONE1 output assigned to XBARB2_IN51 input. */
#define IMXRT_XBARB2_IN_DMA_DONE2             IMXRT_XBARB2(XBAR_INPUT, 52)   /* DMA_DONE2 output assigned to XBARB2_IN52 input. */
#define IMXRT_XBARB2_IN_DMA_DONE3             IMXRT_XBARB2(XBAR_INPUT, 53)   /* DMA_DONE3 output assigned to XBARB2_IN53 input. */
#define IMXRT_XBARB2_IN_DMA_DONE4             IMXRT_XBARB2(XBAR_INPUT, 54)   /* DMA_DONE4 output assigned to XBARB2_IN54 input. */
#define IMXRT_XBARB2_IN_DMA_DONE5             IMXRT_XBARB2(XBAR_INPUT, 55)   /* DMA_DONE5 output assigned to XBARB2_IN55 input. */
#define IMXRT_XBARB2_IN_DMA_DONE6             IMXRT_XBARB2(XBAR_INPUT, 56)   /* DMA_DONE6 output assigned to XBARB2_IN56 input. */
#define IMXRT_XBARB2_IN_DMA_DONE7             IMXRT_XBARB2(XBAR_INPUT, 57)   /* DMA_DONE7 output assigned to XBARB2_IN57 input. */

